In [1]:
import pandas as pd

dictionary = {"Name":["gamze","beren","duru","miray","derya"],
             "Age":[22,21,23,None,24,],
             "Note":[4,54,78,23,2321]}

dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

    Name   Age  Note
0  gamze  22.0     4
1  beren  21.0    54
2   duru  23.0    78
3  miray   NaN    23
4  derya  24.0  2321

In [2]:
head = dataframe1.head() 
print(head)

    Name   Age  Note
0  gamze  22.0     4
1  beren  21.0    54
2   duru  23.0    78
3  miray   NaN    23
4  derya  24.0  2321

In [3]:
tail = dataframe1.tail()
print(tail)

    Name   Age  Note
0  gamze  22.0     4
1  beren  21.0    54
2   duru  23.0    78
3  miray   NaN    23
4  derya  24.0  2321

In [4]:
print(dataframe1.columns)

Index(['Name', 'Age', 'Note'], dtype='object')

In [5]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   Note    5 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes
None

In [6]:
print(dataframe1.describe())

             Age         Note
count   4.000000     5.000000
mean   22.500000   496.000000
std     1.290994  1020.601048
min    21.000000     4.000000
25%    21.750000    23.000000
50%    22.500000    54.000000
75%    23.250000    78.000000
max    24.000000  2321.000000

In [9]:
print(dataframe1["Name"]) 
print(dataframe1.loc[:, "Age"])                      
dataframe1["yeni_future"] = [1,2,3,4,5]
print(dataframe1.loc[:3,"Age"]) 
print(dataframe1.loc[:3, "Name":"Note"])                 
print(dataframe1.loc[::-1])

0    gamze
1    beren
2     duru
3    miray
4    derya
Name: Name, dtype: object
0    22.0
1    21.0
2    23.0
3     NaN
4    24.0
Name: Age, dtype: float64
0    22.0
1    21.0
2    23.0
3     NaN
Name: Age, dtype: float64
    Name   Age  Note
0  gamze  22.0     4
1  beren  21.0    54
2   duru  23.0    78
3  miray   NaN    23
    Name   Age  Note  yeni_future
4  derya  24.0  2321            5
3  miray   NaN    23            4
2   duru  23.0    78            3
1  beren  21.0    54            2
0  gamze  22.0     4            1

In [10]:
print(dataframe1.yeni_future)

0    1
1    2
2    3
3    4
4    5
Name: yeni_future, dtype: int64

In [13]:

print(dataframe1.loc[:1,"Age"])

0    22.0
1    21.0
Name: Age, dtype: float64

In [14]:
print(dataframe1.loc[:2, ["Name","Note"]])

    Name  Note
0  gamze     4
1  beren    54
2   duru    78

In [15]:
print(dataframe1.loc[:,:"Age"])

    Name   Age
0  gamze  22.0
1  beren  21.0
2   duru  23.0
3  miray   NaN
4  derya  24.0

In [17]:
print(dataframe1.iloc[:,[1]])

    Age
0  22.0
1  21.0
2  23.0
3   NaN
4  24.0

In [18]:
filtre1 = dataframe1.Age>35                           
dataframe1["Bool"]= filtre1
print(dataframe1.loc[:,["Age","Bool"]])

    Age   Bool
0  22.0  False
1  21.0  False
2  23.0  False
3   NaN  False
4  24.0  False

In [19]:
type(filtre1)

pandas.core.series.Series

In [20]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

Empty DataFrame
Columns: [Name, Age, Note, yeni_future, Bool]
Index: []

In [22]:
filtre2 = dataframe1.Note>70
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

Empty DataFrame
Columns: [Name, Age, Note, yeni_future, Bool]
Index: []

In [23]:
dataframe1[dataframe1.Age>3]

    Name   Age  Note  yeni_future   Bool
0  gamze  22.0     4            1  False
1  beren  21.0    54            2  False
2   duru  23.0    78            3  False
4  derya  24.0  2321            5  False

In [24]:
import numpy as np
ortalama = dataframe1.Note.mean()
print(ortalama)
ortlama_np= np.mean(dataframe1.Note) 
print(ortlama_np)

496.0
496.0

In [26]:
dataframe1.dropna(inplace=True)

dataframe1

    Name   Age  Note  yeni_future   Bool
0  gamze  22.0     4            1  False
1  beren  21.0    54            2  False
2   duru  23.0    78            3  False
4  derya  24.0  2321            5  False

In [27]:
print(dataframe1.Note.mean()) 
dataframe1["Ortalama"]= ["ortalama altında" if dataframe1.Note.mean()>each else "ortalama üstünde" for each in dataframe1.Note]
dataframe1

614.25

    Name   Age  Note  yeni_future   Bool          Ortalama
0  gamze  22.0     4            1  False  ortalama altında
1  beren  21.0    54            2  False  ortalama altında
2   duru  23.0    78            3  False  ortalama altında
4  derya  24.0  2321            5  False  ortalama üstünde

In [28]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_FUTURE', 'BOOL', 'ORTALAMA'], dtype='object')

In [30]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_FUTURE', 'BOOL', 'ORTALAMA'], dtype='object')

In [31]:
dataframe1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] if len(each.split(" "))>1 else each for each in dataframe1.columns]
dataframe1

    NAME   AGE  NOTE  YENI_FUTURE   BOOL          ORTALAMA
0  gamze  22.0     4            1  False  ortalama altında
1  beren  21.0    54            2  False  ortalama altında
2   duru  23.0    78            3  False  ortalama altında
4  derya  24.0  2321            5  False  ortalama üstünde

In [33]:
dataframe1.columns = [ each.split(" ")[1]+"_"+each.split(" ")[1] if len(each.split(" "))>2 else each for each in dataframe1.columns]
dataframe1

    NAME   AGE  NOTE  YENI_FUTURE   BOOL          ORTALAMA
0  gamze  22.0     4            1  False  ortalama altında
1  beren  21.0    54            2  False  ortalama altında
2   duru  23.0    78            3  False  ortalama altında
4  derya  24.0  2321            5  False  ortalama üstünde